package com.activity;
/** 
 * @author 作者 E-mail: 
 * @version 创建时间：2016-1-4 下午10:52:31 
 * 类说明   未做完统计
 */
public class AAAAAAAA {
	
	/**
	 * 1.首界面搜索（已完成）
	 * 2.地图部分，在高版本手机上出现bug，闪退，貌似是版本不支持（已解决）
	 * 3.投诉列表页已经做完，目前需要做投诉详情页(已做完，但数据接口部分数据没有)
	 * 4.首界面scrollview需要下拉刷新（布局已写，但数据未刷新）
	 * 5.微信分享与支付（支付宝已做完）
	 * 6.充值界面也需要用到支付
	 * 7.物流详情时光轴没有数据
	 * 8.画中画功能
	 * 9.找回密码
	 * 10.所有按钮的点击动画       (已完成)
	 * 11.所有页面的返回按钮和回到主页按钮(已完成)
	 * 12.个人资料里面支付密码找回（已完成）
	 * 13.微信登录
	 * 14.发起新投诉，需要上传图片之类的，和首界面搜索是一样的（已做完）
	 * 15.启动页，引导页。(已完成)
	 * 16.缓存，估计做也就是做全部商品那一页和首页那一页。
	 * 17.找回密码点击就奔溃了（已解决）
	 * 18.
	 * 1.投诉详情页面需要改动ui。
	 * 3.申请退款和申请售后未做。  (已做，但是数据接口有问题)
	 * 2.退款与售后无详情页面    （而且无数据接口）
	 * 3.退出账号，未做。
	 * 4.确认收货未修改(已完成)
	 * 5.账号余额支付，未做。
	 * 6.充值界面，未做。（无生成订单号的数据接口）
	 * 7.地图定位问题。
	 * 8.刷新界面。（weizuo ）
	 * 9.加载动画已全部做完(已完成)
	 * 
	 * 找回支付密码    验证码跟本地进行比对（已完成，账号支付也是一样，均已完成）
	 * 
	 * ******************************************************************
	 * 1。订单详情借口不合适
	 * 2。时光轴因数据问题，暂未曾加载。
	 * 3。订单详情那里，用户选择服务的时候，页面标题头未改变(已完成)
	 * 4。首界面viewpager点击事件(已解决)
	 * 5。地图定位问题(已解决)
	 * 6.找回密码这里数据接口有问题
	 * 7.登录界面bug已经解决。
	 * */

}
